var dict4="1동: 인문관 1동\
2동: 인문관 2동\
3동: 인문관 3동\
4동: 신양인문학술정보관\
5동: 인문관 4동\
6동: 인문관 5동\
7동: 인문관 6동\
8동: 두산인문관\
9동: 사범관 1동\
10동: 사범관 2동\
10-1동: 사범대교육정보관\
11동: 사범관 3동\
12동: 사범교육협력센터\
13동: 과학교육관\
14동: 인문관 7동\
15동: 법학관 1동\
15-1동: 우천법학관\
16동: 사회대\
16-1동: 신양학술정보관III\
17동: 법학관 2동\
18동: 자연과학관 1동\
19동: 자연과학관 2동\
20동: 약학관 3동\
21동: 약학관 1동\
21-1동: 약대 시약창고\
22동: 자연과학관 4동\
23동: 자연과학관 5동\
24동: 자연과학관 6동\
25동: 자연과학관 7동\
25-1동: 자연대강의및실험연구동\
26동: 기초과학실험교육동\
27동: 자연과학관 9동\
28동: 자연대대형강의동\
29동: 약학관 2동\
30동: 공학관 1동\
30-1동: 위험물 옥내 저장소\
30-2동: 공대 간이식당\
31동: 공학관 2동\
32동: 공학관 3동\
32-1동: 해동학술문화관\
33동: 공학관 4동\
34동: 공학관 5동\
35동: 공학관 6동\
36동: 공학관 7동\
37동: 공학관 8동\
38동: 글로벌공학교육센터\
39동: 대학원연구동\
40동: 풍동실험동1\
41동: 선체구조실험동\
42동: 선형수조실험동\
42-1동: 슬로싱실험동\
43동: 공대대형강의동\
43-1동: 멀티미디어강의동\
44동: 풍동실험동2\
44-1동: 신양학술정보관\
45동: 천문관측소\
46동: 천문대\
47동: 기상관측소\
48동: 지진관측소\
48-1동: 전파천문대\
49동: 예술관연구동\
50동: 예술관 1동\
51동: 예술관 2동\
52동: 예술관 3동\
52-1동: 미대교양실습동\
52-2동: 야외조각실습장2\
53동: 예술관 1동\
54동: 예술관 2동\
55동: 예술관 3동\
56동: 자연과학관 10동\
57동: 행정대학원 구관\
57-1동: 행정대학원 신관\
58동: SK경영관\
59동: LG경영관\
60동: 행정관\
61동: 교수학습개발센터 및 기초교육원\
62동: 중앙도서관\
62-1동: 관정도서관\
63동: 학생회관\
64동: IBK 커뮤니케이션 센터\
65동: 교수회관\
66동: 학생군사교육단\
67동: 두레문예관\
68동: 제1파워플랜트\
68-1동: 신림변전소\
68-2동: 영선공장\
69동: 실험동물자원관리원\
70동: 박물관\
71동: 체육관\
71-1동: 체육문화교육연구동\
71-2동: 포스코스포츠센터\
72동: 법학도서관\
73동: 문화관\
74동: 예술계복합교육연구동\
75동: 대학신문사\
75-1동: 제3식당\
76동: 제4식당\
76-1동: 주차타워\
80동: 수의대부속동물병원\
80-1동: 생물공학연구소\
81동: 생명공학연구동\
82동: 환경대학원\
83동: 멀티미디어강의동\
84동: 근대법학교육백주년기념관\
85동: 수의대\
85-1동: 수의대시약보관창고\
86동: 치의학대학원 첨단복합연구단지 및 의료센터\
97동: 환경안전원\
98동: 환경안전원\
98-2동: 폐기물창고\
99-1동: 정구장 관리실\
100동: 버들골 풍산마당\
101동: 아시아연구소\
102동: 중앙전산원\
103동: 규장각한국학연구원\
104동: 반도체공동연구소\
104-1동: 반도체공동연구소 교육관\
104-2동: 반도체공동연구소 화공약품창고\
104-3동: 반도체공동연구소 수소창고\
105동: 유전공학연구소\
105-1동: 창업보육센터 및 유전공학연구소\
105-2동: 유전공학연구소 신관\
106동: 수영장\
107-1동: 방가로1\
107-2동: 방가로2\
107-3동: 방가로3\
109동: 자하연식당\
110동: 솔밭간이식당\
111동: 파스쿠치\
113동: 동원생활관\
115동: 정문수위실\
117동: 양수장\
120동: 위험물저장고\
121동: 총장공관\
122동-1동: 교수아파트 1동\
122동-2동: 교수아파트 2동\
122동-3동: 교수아파트 3동\
122동-4동: 교수아파트 4동\
122동-5동: 교수아파트 5동\
122동-6동: 교수아파트 6동\
122동-7동: 교수아파트 7동\
125동: 호암교수회관\
125-1동: 컨벤션센터\
125-2동: SK게스트하우스\
126동: 호암동관\
127동: 호암서관\
127-1동: 호암교수회관 관리실\
128동: 호암창고\
129동: 상산수리과학관\
130동: 기초전력공학공동연구소\
131동: 신소재공동연구소\
132동: 뉴미디어통신공동연구소\
133동: 자동화시스템연구소\
135동: 에너지자원신기술연구소\
137동: 언어교육원\
137-1동: CJ어학관\
137-2동: 대림국제관\
138동: 컴퓨터신기술공동연구소\
139동: 기초과학공동기기원\
139-1동: 정전가속기동\
140동: 국제대학원\
140-1동: 국제대학원2동\
140-2동: 국제회의동\
141동: 약학관 4동\
142동: 약학관 5동\
143동: 약대신약개발연구센터\
144동: 후문수위실\
149동: 종합운동장 본부석\
150동: 교수종합연구동\
151동: 미술관\
152동: CJ인터내셔널센터\
152-1동: 롯데국제교육관\
153동: 우정원 글로벌사회공헌센터\
200동: 농생명대\
201동: 농생대 환경관\
203동: SPC 농생명과학 및 기초과학연구동\
207동: 야외조각실습장1\
220동: 종합교육연구동\
221동: 보건대학원\
222동: 생활대\
223동: 대학원교육연구동3\
250동: 인문관 연결동\
251동: 사회관 연결동\
252동: 교육관 연결동\
253동: 화학관 연결동\
254동: 물리관 연결동\
255동: 예능관 연결동\
300동: 신축 공사중\
301동: 제1공학관\
302동: 제2공학관\
302-1동: 공대위험물저장창고\
310동: 엔지니어하우스\
311동: 화학공정신기술연구소\
312동: 정밀기계설계공동연구소실험연구동\
313동: 정밀기계설계공동연구소\
314동: 차세대자동차신기술연구소\
316동: 대형구조실험동\
330동: 제2파워플랜트\
331동: 차량정비고\
332동: 다목적차량보관소\
500동: 대학원연구동\
506동: 자연대 생명과학부 시약보관창고\
900동: 대학원생활관\
901동: 대학원생활관\
902동: 대학원생활관\
903동: 대학원생활관\
904동: 대학원생활관\
905동: 대학원생활관\
906동: 대학원생활관\
918동: 대학원생활관\
919동: 학부생활관\
920동: 관악사후생관\
921동: 학부생활관\
922동: 학부생활관\
923동: 학부생활관\
924동: 학부생활관\
925동: 학부생활관\
926동: 학부생활관\
931동: 가족생활관1\
932동: 가족생활관2\
933동: 가족생활관3\
934동: 가족생활관4\
935동: 가족생활관5\
936동: 교직원아파트\
940동: 연구공원지원시설\
941동: 백학어린이집\
941-1동: 느티나무어린이집\
942동: LG연구동\
943동: SK텔레콤연구동\
944동: 삼성전자서울대연구소\
945동: 웅진 R&D센터\
946동: BK국제관\
950동: 국제백신연구소";
