var articleDft ='기사 본문만 붙여넣으세요\n\
\
예시1)\n\
 지난달 23일 두산인문관(8동)에서 2017 하반기 임시 전체학생대표자회의(전학대회)가 열리었다.  이번 전학대회에서는 지난 전학대회에서 논의되지 못했던 예결산안과 시흥캠퍼스 문제 대응 방향 등이 논의되었다.(‘대학신문’ 2017년 12월 4일자)\n\
사회과학대학 A 학생회장(정치학과가운뎃점15)은 "이번 전학대회에서 결정된 시흥캠퍼스 문제 대응 기조에 동의하기 어렵다"고 밝혔다.\n\
\n\
예시2)\n\
총운영위원회(총운위) 총운위 총운위(O)\n\
총학생회 총학생회 총학생회장 총학생회 총학생회(O)\n\
전체학생총회 총회 전체학생총회 총회 총회 (X)\n\
단과대운영위원회(단운위) 단과대운영위원회(단운위) 단운위 단운위 (X)\n\
총추위 총장추천위원회(총추위) 총추위 (X)\n\
생활협동조합(생협) 생활협동조합 (X)\n\
\n\
예시3)\n\
지난달 23일(화) 학내 한 카페에서 정년퇴임을 앞둔 C 교수를 만났다. 2일(화)부터 운동을 시작했다는 그의 표정엔 여유가 있어 보였다. 그가 새로운 분야로 뛰어들기로 결심한 것은 재작년 8월 20일(화)이었다.\n\
\n\
예시4)\n\
천문대(46동)에서 학술행사가 열렸다. 이날 천문대엔 많은 사람들이 모였다. 46동은 규모가 크다. (O)\n\
12동의 건물 이름은 무엇일까? (X)\n\
우정원 글로벌사회공헌센터의 건물 번호는 무엇일까?(X)\n\
예술관(음대)1은 어디에 있나요? 예술관(음대)1(53동)은 인문사회계멀티미디어강의동(83동) 근처에 있습니다. (X) \n\
인문관7(13동)은 지은 지 오래되지 않았다. (X) \n\
사회대 학생회장은 누구인가? 사회대(16동)에 가면 알 수 있다. (O)\n\
미술관(151동) 미술관(151동) 미술관 미술관(X)';

var outputDft ='';
var errorConsoleDft ='<b>페이지 우측 하단 메신저를 통해 추가해야 할 단어, 기능 개선점 등을 건의해주세요.<br>욕설, 비방, 도배, 사이트와 관련없는 채팅은 고지 없이 자동으로 고발조치됩니다.</b>';
