var dict2="전체학생대표자회의	전학대회\
    총운영위원회	총운위\
    총학생회	총학\
    단과대운영위원회	단운위\
    총장추천위원회	총추위\
    전체학생총회	총회\
    서울대의 민주주의와 공공성을 위한 학생모임	공공모임\
    교수협의회	교협\
    사회학과 H교수 사건대응을 위한 학생연대	학생연대\
    대학원총학생회	원총\
    서울일반노동조합 서울대지부	일반노조\
    전국대학노동조합 서울대지부	대학노조\
    관악학생생활관	관악사(?!후생관)\
    징계위원회	징계위\
    비정규직 없는 서울대 만들기 공동행동	공동행동\
    동아리연합회	동연(?!구소)\
    중앙집행위원회	중집\
    시흥캠퍼스	시흥캠\
    추진위원회	추진위\
    평창캠퍼스	평창캠\
    학생·소수자인권위원회	학소위\
    대학행정자치연구위원회	대자연\
    문화자치위원회	문자위\
    전체동아리대표자협의회의	전동대회\
    자치언론기금	자언기\
    축제하는 사람들	축하사\
    산학협력단	산단\
    지방노동위원회	지노위\
    중앙노동위원회	중노위\
    부당 징계 철회! 시흥캠퍼스 강행 중단! 투쟁위원회	징투위\
    선거운동본부	선본\
    국립대학법인 서울대학교 설립·운영에 관한 법률	서울대법\
    생활협동조합	생협";
